#Розробіть скрипт, який приймає шлях до директорії в якості аргументу командного рядка і візуалізує структуру цієї директорії, 
#виводячи імена всіх піддиректорій та файлів. 
#Для кращого візуального сприйняття, імена директорій та файлів мають відрізнятися за кольором.

#Вимоги до завдання:
#Створіть віртуальне оточення Python для ізоляції залежностей проєкту.
#Скрипт має отримувати шлях до директорії як аргумент при запуску. Цей шлях вказує, де знаходиться директорія, структуру якої потрібно відобразити.
#Використання бібліотеки colorama для реалізації кольорового виведення.
#Скрипт має коректно відображати як імена директорій, так і імена файлів, використовуючи рекурсивний спосіб обходу директорій (можна, за бажанням, використати не рекурсивний спосіб).
#Повинна бути перевірка та обробка помилок, наприклад, якщо вказаний шлях не існує або він не веде до директорії.

from colorama import Fore
import sys
from pathlib import Path

def get_dir_content(path:Path)->list:
   a = [1,2,2,3,4]
   a.remove()
   pass



def main():
    if len(sys.argv)>=2:
        try:
            path = Path(sys.argv[1]) 
            path = path.absolute()
            for obj in path.iterdir():
               if obj.is_dir():
                print(obj) 
        except Exception:
            print("No path found for display")



if __name__ == "__main__":
    main()
